Revit 2027 API
BuiltInFailures.SweepFailures.ComplexPathWithComplexProfile Property
 Sweep cannot have a path with ellipse or spline segments and a profile with non-straight lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ComplexPathWithComplexProfile { get; }
Public Shared ReadOnly Property ComplexPathWithComplexProfile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ComplexPathWithComplexProfile {
	FailureDefinitionId^ get ();
}
static member ComplexPathWithComplexProfile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SweepFailures Class
Autodesk.Revit.DB Namespace